<abi-corpus version='2.1' path='libnvpair.so' architecture='elf-amd-x86_64' soname='libnvpair.so.3'>
  <elf-needed>
    <dependency name='libtirpc.so.3'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='dump_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_boolean_value' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_byte_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='fnvlist_add_int32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='nvpair_value_nvlist' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_nvlist_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_string_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint16_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint32_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint64_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_value_uint8_array' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='aok' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_nosleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_nosleep_def' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_sleep' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_alloc_sleep_def' size='16' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nv_fixed_ops_def' size='40' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvlist_hashtable_init_size' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='nvpair_max_recursion' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../../module/nvpair/fnvpair.c' comp-dir-path='/root/zfs-spp/lib/libnvpair' language='LANG_C99'>
    <function-decl name='fnvlist_alloc' mangled-name='fnvlist_alloc' filepath='../../module/nvpair/fnvpair.c' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_alloc'>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_free' mangled-name='fnvlist_free' filepath='../../module/nvpair/fnvpair.c' line='59' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_free'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='59' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_size' mangled-name='fnvlist_size' filepath='../../module/nvpair/fnvpair.c' line='65' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_size'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='65' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fnvlist_pack' mangled-name='fnvlist_pack' filepath='../../module/nvpair/fnvpair.c' line='77' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_pack'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='77' column='1'/>
      <parameter type-id='type-id-4' name='sizep' filepath='../../module/nvpair/fnvpair.c' line='77' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_pack_free' mangled-name='fnvlist_pack_free' filepath='../../module/nvpair/fnvpair.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_pack_free'>
      <parameter type-id='type-id-5' name='pack' filepath='../../module/nvpair/fnvpair.c' line='87' column='1'/>
      <parameter type-id='type-id-3' name='size' filepath='../../module/nvpair/fnvpair.c' line='87' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_unpack' mangled-name='fnvlist_unpack' filepath='../../module/nvpair/fnvpair.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_unpack'>
      <parameter type-id='type-id-5' name='buf' filepath='../../module/nvpair/fnvpair.c' line='97' column='1'/>
      <parameter type-id='type-id-3' name='buflen' filepath='../../module/nvpair/fnvpair.c' line='97' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_dup' mangled-name='fnvlist_dup' filepath='../../module/nvpair/fnvpair.c' line='105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_dup'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='105' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_merge' mangled-name='fnvlist_merge' filepath='../../module/nvpair/fnvpair.c' line='113' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_merge'>
      <parameter type-id='type-id-1' name='dst' filepath='../../module/nvpair/fnvpair.c' line='113' column='1'/>
      <parameter type-id='type-id-1' name='src' filepath='../../module/nvpair/fnvpair.c' line='113' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_num_pairs' mangled-name='fnvlist_num_pairs' filepath='../../module/nvpair/fnvpair.c' line='119' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_num_pairs'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='119' column='1'/>
      <return type-id='type-id-3'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean' mangled-name='fnvlist_add_boolean' filepath='../../module/nvpair/fnvpair.c' line='131' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='131' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='131' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_value' mangled-name='fnvlist_add_boolean_value' filepath='../../module/nvpair/fnvpair.c' line='137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean_value'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='137' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='137' column='1'/>
      <parameter type-id='type-id-7' name='val' filepath='../../module/nvpair/fnvpair.c' line='137' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte' mangled-name='fnvlist_add_byte' filepath='../../module/nvpair/fnvpair.c' line='143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_byte'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='143' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='143' column='1'/>
      <parameter type-id='type-id-8' name='val' filepath='../../module/nvpair/fnvpair.c' line='143' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int8' mangled-name='fnvlist_add_int8' filepath='../../module/nvpair/fnvpair.c' line='149' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='149' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='149' column='1'/>
      <parameter type-id='type-id-9' name='val' filepath='../../module/nvpair/fnvpair.c' line='149' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8' mangled-name='fnvlist_add_uint8' filepath='../../module/nvpair/fnvpair.c' line='155' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='155' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='155' column='1'/>
      <parameter type-id='type-id-10' name='val' filepath='../../module/nvpair/fnvpair.c' line='155' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int16' mangled-name='fnvlist_add_int16' filepath='../../module/nvpair/fnvpair.c' line='161' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='161' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='161' column='1'/>
      <parameter type-id='type-id-11' name='val' filepath='../../module/nvpair/fnvpair.c' line='161' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint16' mangled-name='fnvlist_add_uint16' filepath='../../module/nvpair/fnvpair.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='167' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='167' column='1'/>
      <parameter type-id='type-id-12' name='val' filepath='../../module/nvpair/fnvpair.c' line='167' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32' mangled-name='fnvlist_add_int32' filepath='../../module/nvpair/fnvpair.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='173' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='173' column='1'/>
      <parameter type-id='type-id-13' name='val' filepath='../../module/nvpair/fnvpair.c' line='173' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint32' mangled-name='fnvlist_add_uint32' filepath='../../module/nvpair/fnvpair.c' line='179' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='179' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='179' column='1'/>
      <parameter type-id='type-id-14' name='val' filepath='../../module/nvpair/fnvpair.c' line='179' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int64' mangled-name='fnvlist_add_int64' filepath='../../module/nvpair/fnvpair.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='185' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='185' column='1'/>
      <parameter type-id='type-id-15' name='val' filepath='../../module/nvpair/fnvpair.c' line='185' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64' mangled-name='fnvlist_add_uint64' filepath='../../module/nvpair/fnvpair.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='191' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='191' column='1'/>
      <parameter type-id='type-id-16' name='val' filepath='../../module/nvpair/fnvpair.c' line='191' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_string' mangled-name='fnvlist_add_string' filepath='../../module/nvpair/fnvpair.c' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_string'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='197' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='197' column='1'/>
      <parameter type-id='type-id-6' name='val' filepath='../../module/nvpair/fnvpair.c' line='197' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist' mangled-name='fnvlist_add_nvlist' filepath='../../module/nvpair/fnvpair.c' line='203' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvlist'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='203' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='203' column='1'/>
      <parameter type-id='type-id-1' name='val' filepath='../../module/nvpair/fnvpair.c' line='203' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvpair' mangled-name='fnvlist_add_nvpair' filepath='../../module/nvpair/fnvpair.c' line='209' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='209' column='1'/>
      <parameter type-id='type-id-17' name='pair' filepath='../../module/nvpair/fnvpair.c' line='209' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_boolean_array' mangled-name='fnvlist_add_boolean_array' filepath='../../module/nvpair/fnvpair.c' line='215' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_boolean_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='215' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='215' column='1'/>
      <parameter type-id='type-id-18' name='val' filepath='../../module/nvpair/fnvpair.c' line='216' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='216' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_byte_array' mangled-name='fnvlist_add_byte_array' filepath='../../module/nvpair/fnvpair.c' line='222' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_byte_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <parameter type-id='type-id-20' name='val' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='222' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int8_array' mangled-name='fnvlist_add_int8_array' filepath='../../module/nvpair/fnvpair.c' line='228' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <parameter type-id='type-id-21' name='val' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='228' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint8_array' mangled-name='fnvlist_add_uint8_array' filepath='../../module/nvpair/fnvpair.c' line='234' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <parameter type-id='type-id-22' name='val' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='234' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int16_array' mangled-name='fnvlist_add_int16_array' filepath='../../module/nvpair/fnvpair.c' line='240' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <parameter type-id='type-id-23' name='val' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='240' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint16_array' mangled-name='fnvlist_add_uint16_array' filepath='../../module/nvpair/fnvpair.c' line='246' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='246' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='246' column='1'/>
      <parameter type-id='type-id-24' name='val' filepath='../../module/nvpair/fnvpair.c' line='247' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='247' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int32_array' mangled-name='fnvlist_add_int32_array' filepath='../../module/nvpair/fnvpair.c' line='253' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <parameter type-id='type-id-25' name='val' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='253' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint32_array' mangled-name='fnvlist_add_uint32_array' filepath='../../module/nvpair/fnvpair.c' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='259' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='259' column='1'/>
      <parameter type-id='type-id-26' name='val' filepath='../../module/nvpair/fnvpair.c' line='260' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='260' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_int64_array' mangled-name='fnvlist_add_int64_array' filepath='../../module/nvpair/fnvpair.c' line='266' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_int64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <parameter type-id='type-id-27' name='val' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='266' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_uint64_array' mangled-name='fnvlist_add_uint64_array' filepath='../../module/nvpair/fnvpair.c' line='272' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_uint64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='272' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='272' column='1'/>
      <parameter type-id='type-id-28' name='val' filepath='../../module/nvpair/fnvpair.c' line='273' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='273' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_string_array' mangled-name='fnvlist_add_string_array' filepath='../../module/nvpair/fnvpair.c' line='279' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_string_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='279' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='279' column='1'/>
      <parameter type-id='type-id-29' name='val' filepath='../../module/nvpair/fnvpair.c' line='280' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='280' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_add_nvlist_array' mangled-name='fnvlist_add_nvlist_array' filepath='../../module/nvpair/fnvpair.c' line='286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_add_nvlist_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='286' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='286' column='1'/>
      <parameter type-id='type-id-30' name='val' filepath='../../module/nvpair/fnvpair.c' line='287' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/fnvpair.c' line='287' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_remove' mangled-name='fnvlist_remove' filepath='../../module/nvpair/fnvpair.c' line='293' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_remove'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='293' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='293' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_remove_nvpair' mangled-name='fnvlist_remove_nvpair' filepath='../../module/nvpair/fnvpair.c' line='299' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_remove_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='299' column='1'/>
      <parameter type-id='type-id-17' name='pair' filepath='../../module/nvpair/fnvpair.c' line='299' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvpair' mangled-name='fnvlist_lookup_nvpair' filepath='../../module/nvpair/fnvpair.c' line='305' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='305' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='305' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean' mangled-name='fnvlist_lookup_boolean' filepath='../../module/nvpair/fnvpair.c' line='314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='314' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='314' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_value' mangled-name='fnvlist_lookup_boolean_value' filepath='../../module/nvpair/fnvpair.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean_value'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='320' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='320' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_byte' mangled-name='fnvlist_lookup_byte' filepath='../../module/nvpair/fnvpair.c' line='328' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_byte'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='328' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='328' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int8' mangled-name='fnvlist_lookup_int8' filepath='../../module/nvpair/fnvpair.c' line='336' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='336' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='336' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int16' mangled-name='fnvlist_lookup_int16' filepath='../../module/nvpair/fnvpair.c' line='344' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='344' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='344' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int32' mangled-name='fnvlist_lookup_int32' filepath='../../module/nvpair/fnvpair.c' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='352' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='352' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int64' mangled-name='fnvlist_lookup_int64' filepath='../../module/nvpair/fnvpair.c' line='360' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='360' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='360' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint8' mangled-name='fnvlist_lookup_uint8' filepath='../../module/nvpair/fnvpair.c' line='368' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='368' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='368' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint16' mangled-name='fnvlist_lookup_uint16' filepath='../../module/nvpair/fnvpair.c' line='376' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='376' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='376' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint32' mangled-name='fnvlist_lookup_uint32' filepath='../../module/nvpair/fnvpair.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='384' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='384' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64' mangled-name='fnvlist_lookup_uint64' filepath='../../module/nvpair/fnvpair.c' line='392' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='392' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='392' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_string' mangled-name='fnvlist_lookup_string' filepath='../../module/nvpair/fnvpair.c' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_string'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='400' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='400' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_nvlist' mangled-name='fnvlist_lookup_nvlist' filepath='../../module/nvpair/fnvpair.c' line='408' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_nvlist'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='408' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='408' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_boolean_array' mangled-name='fnvlist_lookup_boolean_array' filepath='../../module/nvpair/fnvpair.c' line='415' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_boolean_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='415' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='415' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='415' column='1'/>
      <return type-id='type-id-18'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_byte_array' mangled-name='fnvlist_lookup_byte_array' filepath='../../module/nvpair/fnvpair.c' line='423' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_byte_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='423' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='423' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='423' column='1'/>
      <return type-id='type-id-20'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int8_array' mangled-name='fnvlist_lookup_int8_array' filepath='../../module/nvpair/fnvpair.c' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='431' column='1'/>
      <return type-id='type-id-21'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint8_array' mangled-name='fnvlist_lookup_uint8_array' filepath='../../module/nvpair/fnvpair.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='439' column='1'/>
      <return type-id='type-id-22'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int16_array' mangled-name='fnvlist_lookup_int16_array' filepath='../../module/nvpair/fnvpair.c' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='447' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='447' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='447' column='1'/>
      <return type-id='type-id-23'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint16_array' mangled-name='fnvlist_lookup_uint16_array' filepath='../../module/nvpair/fnvpair.c' line='455' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='455' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='455' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='455' column='1'/>
      <return type-id='type-id-24'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int32_array' mangled-name='fnvlist_lookup_int32_array' filepath='../../module/nvpair/fnvpair.c' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='463' column='1'/>
      <return type-id='type-id-25'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint32_array' mangled-name='fnvlist_lookup_uint32_array' filepath='../../module/nvpair/fnvpair.c' line='471' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='471' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='471' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='471' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_int64_array' mangled-name='fnvlist_lookup_int64_array' filepath='../../module/nvpair/fnvpair.c' line='479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_int64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='479' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='479' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='479' column='1'/>
      <return type-id='type-id-27'/>
    </function-decl>
    <function-decl name='fnvlist_lookup_uint64_array' mangled-name='fnvlist_lookup_uint64_array' filepath='../../module/nvpair/fnvpair.c' line='487' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvlist_lookup_uint64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/fnvpair.c' line='487' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/fnvpair.c' line='487' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/fnvpair.c' line='487' column='1'/>
      <return type-id='type-id-28'/>
    </function-decl>
    <function-decl name='fnvpair_value_boolean_value' mangled-name='fnvpair_value_boolean_value' filepath='../../module/nvpair/fnvpair.c' line='495' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_boolean_value'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='495' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='fnvpair_value_byte' mangled-name='fnvpair_value_byte' filepath='../../module/nvpair/fnvpair.c' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_byte'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='503' column='1'/>
      <return type-id='type-id-8'/>
    </function-decl>
    <function-decl name='fnvpair_value_int8' mangled-name='fnvpair_value_int8' filepath='../../module/nvpair/fnvpair.c' line='511' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int8'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='511' column='1'/>
      <return type-id='type-id-9'/>
    </function-decl>
    <function-decl name='fnvpair_value_int16' mangled-name='fnvpair_value_int16' filepath='../../module/nvpair/fnvpair.c' line='519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int16'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='519' column='1'/>
      <return type-id='type-id-11'/>
    </function-decl>
    <function-decl name='fnvpair_value_int32' mangled-name='fnvpair_value_int32' filepath='../../module/nvpair/fnvpair.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int32'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='527' column='1'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <function-decl name='fnvpair_value_int64' mangled-name='fnvpair_value_int64' filepath='../../module/nvpair/fnvpair.c' line='535' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_int64'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='535' column='1'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint8' mangled-name='fnvpair_value_uint8' filepath='../../module/nvpair/fnvpair.c' line='543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint8'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='543' column='1'/>
      <return type-id='type-id-10'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint16' mangled-name='fnvpair_value_uint16' filepath='../../module/nvpair/fnvpair.c' line='551' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint16'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='551' column='1'/>
      <return type-id='type-id-12'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint32' mangled-name='fnvpair_value_uint32' filepath='../../module/nvpair/fnvpair.c' line='559' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint32'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='559' column='1'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='fnvpair_value_uint64' mangled-name='fnvpair_value_uint64' filepath='../../module/nvpair/fnvpair.c' line='567' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_uint64'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='567' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fnvpair_value_string' mangled-name='fnvpair_value_string' filepath='../../module/nvpair/fnvpair.c' line='575' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_string'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='575' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='fnvpair_value_nvlist' mangled-name='fnvpair_value_nvlist' filepath='../../module/nvpair/fnvpair.c' line='583' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fnvpair_value_nvlist'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/fnvpair.c' line='583' column='1'/>
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/nvpair/nvpair.c' comp-dir-path='/root/zfs-spp/lib/libnvpair' language='LANG_C99'>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-32'/>
    <qualified-type-def type-id='type-id-5' const='yes' id='type-id-33'/>
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-29'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-35'/>
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-37'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-39'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-41'/>
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-42'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-43'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-44'/>
    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-45'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-47'/>
    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-4'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-48'/>
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-49'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-50'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-51'/>
    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-31'/>
    <var-decl name='nvpair_max_recursion' type-id='type-id-40' mangled-name='nvpair_max_recursion' visibility='default' filepath='../../module/nvpair/nvpair.c' line='151' column='1' elf-symbol-id='nvpair_max_recursion'/>
    <var-decl name='nvlist_hashtable_init_size' type-id='type-id-16' mangled-name='nvlist_hashtable_init_size' visibility='default' filepath='../../module/nvpair/nvpair.c' line='154' column='1' elf-symbol-id='nvlist_hashtable_init_size'/>
    <function-decl name='nv_alloc_init' mangled-name='nv_alloc_init' filepath='../../module/nvpair/nvpair.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_init'>
      <parameter type-id='type-id-53' name='nva' filepath='../../module/nvpair/nvpair.c' line='157' column='1'/>
      <parameter type-id='type-id-54' name='nvo' filepath='../../module/nvpair/nvpair.c' line='157' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nv_alloc_reset' mangled-name='nv_alloc_reset' filepath='../../module/nvpair/nvpair.c' line='174' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_reset'>
      <parameter type-id='type-id-53' name='nva' filepath='../../module/nvpair/nvpair.c' line='174' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nv_alloc_fini' mangled-name='nv_alloc_fini' filepath='../../module/nvpair/nvpair.c' line='181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nv_alloc_fini'>
      <parameter type-id='type-id-53' name='nva' filepath='../../module/nvpair/nvpair.c' line='181' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nv_alloc' mangled-name='nvlist_lookup_nv_alloc' filepath='../../module/nvpair/nvpair.c' line='188' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nv_alloc'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='188' column='1'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='nvlist_nvflag' mangled-name='nvlist_nvflag' filepath='../../module/nvpair/nvpair.c' line='561' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_nvflag'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='561' column='1'/>
      <return type-id='type-id-19'/>
    </function-decl>
    <function-decl name='nvlist_alloc' mangled-name='nvlist_alloc' filepath='../../module/nvpair/nvpair.c' line='587' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_alloc'>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='587' column='1'/>
      <parameter type-id='type-id-19' name='nvflag' filepath='../../module/nvpair/nvpair.c' line='587' column='1'/>
      <parameter type-id='type-id-40' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='587' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_xalloc' mangled-name='nvlist_xalloc' filepath='../../module/nvpair/nvpair.c' line='593' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xalloc'>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='593' column='1'/>
      <parameter type-id='type-id-19' name='nvflag' filepath='../../module/nvpair/nvpair.c' line='593' column='1'/>
      <parameter type-id='type-id-53' name='nva' filepath='../../module/nvpair/nvpair.c' line='593' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_free' mangled-name='nvlist_free' filepath='../../module/nvpair/nvpair.c' line='868' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_free'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='868' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_dup' mangled-name='nvlist_dup' filepath='../../module/nvpair/nvpair.c' line='918' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_dup'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='918' column='1'/>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='918' column='1'/>
      <parameter type-id='type-id-40' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='918' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_xdup' mangled-name='nvlist_xdup' filepath='../../module/nvpair/nvpair.c' line='924' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xdup'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='924' column='1'/>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='924' column='1'/>
      <parameter type-id='type-id-53' name='nva' filepath='../../module/nvpair/nvpair.c' line='924' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_remove_all' mangled-name='nvlist_remove_all' filepath='../../module/nvpair/nvpair.c' line='947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_all'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='947' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='947' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_remove' mangled-name='nvlist_remove' filepath='../../module/nvpair/nvpair.c' line='967' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='967' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='967' column='1'/>
      <parameter type-id='type-id-55' name='type' filepath='../../module/nvpair/nvpair.c' line='967' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_remove_nvpair' mangled-name='nvlist_remove_nvpair' filepath='../../module/nvpair/nvpair.c' line='980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_remove_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='980' column='1'/>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='980' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean' mangled-name='nvlist_add_boolean' filepath='../../module/nvpair/nvpair.c' line='1278' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1278' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1278' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_value' mangled-name='nvlist_add_boolean_value' filepath='../../module/nvpair/nvpair.c' line='1284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_value'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1284' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1284' column='1'/>
      <parameter type-id='type-id-7' name='val' filepath='../../module/nvpair/nvpair.c' line='1284' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_byte' mangled-name='nvlist_add_byte' filepath='../../module/nvpair/nvpair.c' line='1290' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1290' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1290' column='1'/>
      <parameter type-id='type-id-8' name='val' filepath='../../module/nvpair/nvpair.c' line='1290' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_int8' mangled-name='nvlist_add_int8' filepath='../../module/nvpair/nvpair.c' line='1296' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1296' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1296' column='1'/>
      <parameter type-id='type-id-9' name='val' filepath='../../module/nvpair/nvpair.c' line='1296' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8' mangled-name='nvlist_add_uint8' filepath='../../module/nvpair/nvpair.c' line='1302' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1302' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1302' column='1'/>
      <parameter type-id='type-id-10' name='val' filepath='../../module/nvpair/nvpair.c' line='1302' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_int16' mangled-name='nvlist_add_int16' filepath='../../module/nvpair/nvpair.c' line='1308' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1308' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1308' column='1'/>
      <parameter type-id='type-id-11' name='val' filepath='../../module/nvpair/nvpair.c' line='1308' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16' mangled-name='nvlist_add_uint16' filepath='../../module/nvpair/nvpair.c' line='1314' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1314' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1314' column='1'/>
      <parameter type-id='type-id-12' name='val' filepath='../../module/nvpair/nvpair.c' line='1314' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_int32' mangled-name='nvlist_add_int32' filepath='../../module/nvpair/nvpair.c' line='1320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1320' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1320' column='1'/>
      <parameter type-id='type-id-13' name='val' filepath='../../module/nvpair/nvpair.c' line='1320' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32' mangled-name='nvlist_add_uint32' filepath='../../module/nvpair/nvpair.c' line='1326' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1326' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1326' column='1'/>
      <parameter type-id='type-id-14' name='val' filepath='../../module/nvpair/nvpair.c' line='1326' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_int64' mangled-name='nvlist_add_int64' filepath='../../module/nvpair/nvpair.c' line='1332' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1332' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1332' column='1'/>
      <parameter type-id='type-id-15' name='val' filepath='../../module/nvpair/nvpair.c' line='1332' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64' mangled-name='nvlist_add_uint64' filepath='../../module/nvpair/nvpair.c' line='1338' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1338' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1338' column='1'/>
      <parameter type-id='type-id-16' name='val' filepath='../../module/nvpair/nvpair.c' line='1338' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_double' mangled-name='nvlist_add_double' filepath='../../module/nvpair/nvpair.c' line='1345' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_double'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1345' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1345' column='1'/>
      <parameter type-id='type-id-36' name='val' filepath='../../module/nvpair/nvpair.c' line='1345' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_string' mangled-name='nvlist_add_string' filepath='../../module/nvpair/nvpair.c' line='1352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1352' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1352' column='1'/>
      <parameter type-id='type-id-6' name='val' filepath='../../module/nvpair/nvpair.c' line='1352' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_boolean_array' mangled-name='nvlist_add_boolean_array' filepath='../../module/nvpair/nvpair.c' line='1358' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_boolean_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1358' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1358' column='1'/>
      <parameter type-id='type-id-18' name='a' filepath='../../module/nvpair/nvpair.c' line='1359' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1359' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_byte_array' mangled-name='nvlist_add_byte_array' filepath='../../module/nvpair/nvpair.c' line='1365' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_byte_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1365' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1365' column='1'/>
      <parameter type-id='type-id-20' name='a' filepath='../../module/nvpair/nvpair.c' line='1365' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1365' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_int8_array' mangled-name='nvlist_add_int8_array' filepath='../../module/nvpair/nvpair.c' line='1371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1371' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1371' column='1'/>
      <parameter type-id='type-id-21' name='a' filepath='../../module/nvpair/nvpair.c' line='1371' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1371' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_uint8_array' mangled-name='nvlist_add_uint8_array' filepath='../../module/nvpair/nvpair.c' line='1377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1377' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1377' column='1'/>
      <parameter type-id='type-id-22' name='a' filepath='../../module/nvpair/nvpair.c' line='1377' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1377' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_int16_array' mangled-name='nvlist_add_int16_array' filepath='../../module/nvpair/nvpair.c' line='1383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1383' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1383' column='1'/>
      <parameter type-id='type-id-23' name='a' filepath='../../module/nvpair/nvpair.c' line='1383' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1383' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_uint16_array' mangled-name='nvlist_add_uint16_array' filepath='../../module/nvpair/nvpair.c' line='1389' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1389' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1389' column='1'/>
      <parameter type-id='type-id-24' name='a' filepath='../../module/nvpair/nvpair.c' line='1389' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1389' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_int32_array' mangled-name='nvlist_add_int32_array' filepath='../../module/nvpair/nvpair.c' line='1395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1395' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1395' column='1'/>
      <parameter type-id='type-id-25' name='a' filepath='../../module/nvpair/nvpair.c' line='1395' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1395' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_uint32_array' mangled-name='nvlist_add_uint32_array' filepath='../../module/nvpair/nvpair.c' line='1401' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1401' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1401' column='1'/>
      <parameter type-id='type-id-26' name='a' filepath='../../module/nvpair/nvpair.c' line='1401' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1401' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_int64_array' mangled-name='nvlist_add_int64_array' filepath='../../module/nvpair/nvpair.c' line='1407' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_int64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1407' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1407' column='1'/>
      <parameter type-id='type-id-27' name='a' filepath='../../module/nvpair/nvpair.c' line='1407' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1407' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_uint64_array' mangled-name='nvlist_add_uint64_array' filepath='../../module/nvpair/nvpair.c' line='1413' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_uint64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1413' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1413' column='1'/>
      <parameter type-id='type-id-28' name='a' filepath='../../module/nvpair/nvpair.c' line='1413' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1413' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_string_array' mangled-name='nvlist_add_string_array' filepath='../../module/nvpair/nvpair.c' line='1419' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_string_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1419' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1419' column='1'/>
      <parameter type-id='type-id-29' name='a' filepath='../../module/nvpair/nvpair.c' line='1420' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1420' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_hrtime' mangled-name='nvlist_add_hrtime' filepath='../../module/nvpair/nvpair.c' line='1426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_hrtime'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1426' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1426' column='1'/>
      <parameter type-id='type-id-38' name='val' filepath='../../module/nvpair/nvpair.c' line='1426' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist' mangled-name='nvlist_add_nvlist' filepath='../../module/nvpair/nvpair.c' line='1432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1432' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1432' column='1'/>
      <parameter type-id='type-id-1' name='val' filepath='../../module/nvpair/nvpair.c' line='1432' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_nvlist_array' mangled-name='nvlist_add_nvlist_array' filepath='../../module/nvpair/nvpair.c' line='1438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvlist_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1438' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1438' column='1'/>
      <parameter type-id='type-id-30' name='a' filepath='../../module/nvpair/nvpair.c' line='1438' column='1'/>
      <parameter type-id='type-id-19' name='n' filepath='../../module/nvpair/nvpair.c' line='1438' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_next_nvpair' mangled-name='nvlist_next_nvpair' filepath='../../module/nvpair/nvpair.c' line='1445' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_next_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1445' column='1'/>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1445' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_prev_nvpair' mangled-name='nvlist_prev_nvpair' filepath='../../module/nvpair/nvpair.c' line='1474' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prev_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1474' column='1'/>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1474' column='1'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='nvlist_empty' mangled-name='nvlist_empty' filepath='../../module/nvpair/nvpair.c' line='1498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_empty'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1498' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvpair_name' mangled-name='nvpair_name' filepath='../../module/nvpair/nvpair.c' line='1510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_name'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1510' column='1'/>
      <return type-id='type-id-5'/>
    </function-decl>
    <function-decl name='nvpair_type' mangled-name='nvpair_type' filepath='../../module/nvpair/nvpair.c' line='1516' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1516' column='1'/>
      <return type-id='type-id-55'/>
    </function-decl>
    <function-decl name='nvpair_type_is_array' mangled-name='nvpair_type_is_array' filepath='../../module/nvpair/nvpair.c' line='1522' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_type_is_array'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='1522' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean' mangled-name='nvlist_lookup_boolean' filepath='../../module/nvpair/nvpair.c' line='1638' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1638' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1638' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_value' mangled-name='nvlist_lookup_boolean_value' filepath='../../module/nvpair/nvpair.c' line='1644' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_value'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1644' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1644' column='1'/>
      <parameter type-id='type-id-18' name='val' filepath='../../module/nvpair/nvpair.c' line='1644' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte' mangled-name='nvlist_lookup_byte' filepath='../../module/nvpair/nvpair.c' line='1651' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1651' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1651' column='1'/>
      <parameter type-id='type-id-20' name='val' filepath='../../module/nvpair/nvpair.c' line='1651' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8' mangled-name='nvlist_lookup_int8' filepath='../../module/nvpair/nvpair.c' line='1657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1657' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1657' column='1'/>
      <parameter type-id='type-id-21' name='val' filepath='../../module/nvpair/nvpair.c' line='1657' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8' mangled-name='nvlist_lookup_uint8' filepath='../../module/nvpair/nvpair.c' line='1663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1663' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1663' column='1'/>
      <parameter type-id='type-id-22' name='val' filepath='../../module/nvpair/nvpair.c' line='1663' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16' mangled-name='nvlist_lookup_int16' filepath='../../module/nvpair/nvpair.c' line='1669' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1669' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1669' column='1'/>
      <parameter type-id='type-id-23' name='val' filepath='../../module/nvpair/nvpair.c' line='1669' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16' mangled-name='nvlist_lookup_uint16' filepath='../../module/nvpair/nvpair.c' line='1675' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1675' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1675' column='1'/>
      <parameter type-id='type-id-24' name='val' filepath='../../module/nvpair/nvpair.c' line='1675' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32' mangled-name='nvlist_lookup_int32' filepath='../../module/nvpair/nvpair.c' line='1681' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1681' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1681' column='1'/>
      <parameter type-id='type-id-25' name='val' filepath='../../module/nvpair/nvpair.c' line='1681' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32' mangled-name='nvlist_lookup_uint32' filepath='../../module/nvpair/nvpair.c' line='1687' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1687' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1687' column='1'/>
      <parameter type-id='type-id-26' name='val' filepath='../../module/nvpair/nvpair.c' line='1687' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64' mangled-name='nvlist_lookup_int64' filepath='../../module/nvpair/nvpair.c' line='1693' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1693' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1693' column='1'/>
      <parameter type-id='type-id-27' name='val' filepath='../../module/nvpair/nvpair.c' line='1693' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64' mangled-name='nvlist_lookup_uint64' filepath='../../module/nvpair/nvpair.c' line='1699' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1699' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1699' column='1'/>
      <parameter type-id='type-id-28' name='val' filepath='../../module/nvpair/nvpair.c' line='1699' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_double' mangled-name='nvlist_lookup_double' filepath='../../module/nvpair/nvpair.c' line='1706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_double'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1706' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1706' column='1'/>
      <parameter type-id='type-id-37' name='val' filepath='../../module/nvpair/nvpair.c' line='1706' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string' mangled-name='nvlist_lookup_string' filepath='../../module/nvpair/nvpair.c' line='1713' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1713' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1713' column='1'/>
      <parameter type-id='type-id-34' name='val' filepath='../../module/nvpair/nvpair.c' line='1713' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist' mangled-name='nvlist_lookup_nvlist' filepath='../../module/nvpair/nvpair.c' line='1719' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1719' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1719' column='1'/>
      <parameter type-id='type-id-30' name='val' filepath='../../module/nvpair/nvpair.c' line='1719' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_boolean_array' mangled-name='nvlist_lookup_boolean_array' filepath='../../module/nvpair/nvpair.c' line='1725' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_boolean_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1725' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1725' column='1'/>
      <parameter type-id='type-id-32' name='a' filepath='../../module/nvpair/nvpair.c' line='1726' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1726' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_byte_array' mangled-name='nvlist_lookup_byte_array' filepath='../../module/nvpair/nvpair.c' line='1733' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_byte_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1733' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1733' column='1'/>
      <parameter type-id='type-id-48' name='a' filepath='../../module/nvpair/nvpair.c' line='1734' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1734' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int8_array' mangled-name='nvlist_lookup_int8_array' filepath='../../module/nvpair/nvpair.c' line='1740' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1740' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1740' column='1'/>
      <parameter type-id='type-id-45' name='a' filepath='../../module/nvpair/nvpair.c' line='1740' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1740' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint8_array' mangled-name='nvlist_lookup_uint8_array' filepath='../../module/nvpair/nvpair.c' line='1746' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint8_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1746' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1746' column='1'/>
      <parameter type-id='type-id-52' name='a' filepath='../../module/nvpair/nvpair.c' line='1747' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1747' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int16_array' mangled-name='nvlist_lookup_int16_array' filepath='../../module/nvpair/nvpair.c' line='1753' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1753' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1753' column='1'/>
      <parameter type-id='type-id-42' name='a' filepath='../../module/nvpair/nvpair.c' line='1754' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1754' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint16_array' mangled-name='nvlist_lookup_uint16_array' filepath='../../module/nvpair/nvpair.c' line='1760' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint16_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1760' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1760' column='1'/>
      <parameter type-id='type-id-49' name='a' filepath='../../module/nvpair/nvpair.c' line='1761' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1761' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int32_array' mangled-name='nvlist_lookup_int32_array' filepath='../../module/nvpair/nvpair.c' line='1767' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1767' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1767' column='1'/>
      <parameter type-id='type-id-43' name='a' filepath='../../module/nvpair/nvpair.c' line='1768' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1768' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint32_array' mangled-name='nvlist_lookup_uint32_array' filepath='../../module/nvpair/nvpair.c' line='1774' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint32_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1774' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1774' column='1'/>
      <parameter type-id='type-id-50' name='a' filepath='../../module/nvpair/nvpair.c' line='1775' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1775' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_int64_array' mangled-name='nvlist_lookup_int64_array' filepath='../../module/nvpair/nvpair.c' line='1781' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_int64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1781' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1781' column='1'/>
      <parameter type-id='type-id-44' name='a' filepath='../../module/nvpair/nvpair.c' line='1782' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1782' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_uint64_array' mangled-name='nvlist_lookup_uint64_array' filepath='../../module/nvpair/nvpair.c' line='1788' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_uint64_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1788' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1788' column='1'/>
      <parameter type-id='type-id-51' name='a' filepath='../../module/nvpair/nvpair.c' line='1789' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1789' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_string_array' mangled-name='nvlist_lookup_string_array' filepath='../../module/nvpair/nvpair.c' line='1795' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_string_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1795' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1795' column='1'/>
      <parameter type-id='type-id-35' name='a' filepath='../../module/nvpair/nvpair.c' line='1796' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1796' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvlist_array' mangled-name='nvlist_lookup_nvlist_array' filepath='../../module/nvpair/nvpair.c' line='1802' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvlist_array'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1802' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1802' column='1'/>
      <parameter type-id='type-id-46' name='a' filepath='../../module/nvpair/nvpair.c' line='1803' column='1'/>
      <parameter type-id='type-id-31' name='n' filepath='../../module/nvpair/nvpair.c' line='1803' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_hrtime' mangled-name='nvlist_lookup_hrtime' filepath='../../module/nvpair/nvpair.c' line='1809' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_hrtime'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1809' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='1809' column='1'/>
      <parameter type-id='type-id-39' name='val' filepath='../../module/nvpair/nvpair.c' line='1809' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_pairs' mangled-name='nvlist_lookup_pairs' filepath='../../module/nvpair/nvpair.c' line='1815' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_pairs'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='1815' column='1'/>
      <parameter type-id='type-id-40' name='flag' filepath='../../module/nvpair/nvpair.c' line='1815' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvpair' mangled-name='nvlist_lookup_nvpair' filepath='../../module/nvpair/nvpair.c' line='2065' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2065' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='2065' column='1'/>
      <parameter type-id='type-id-47' name='ret' filepath='../../module/nvpair/nvpair.c' line='2065' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_lookup_nvpair_embedded_index' mangled-name='nvlist_lookup_nvpair_embedded_index' filepath='../../module/nvpair/nvpair.c' line='2075' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_lookup_nvpair_embedded_index'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2075' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='2076' column='1'/>
      <parameter type-id='type-id-47' name='ret' filepath='../../module/nvpair/nvpair.c' line='2076' column='1'/>
      <parameter type-id='type-id-41' name='ip' filepath='../../module/nvpair/nvpair.c' line='2076' column='1'/>
      <parameter type-id='type-id-34' name='ep' filepath='../../module/nvpair/nvpair.c' line='2076' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_exists' mangled-name='nvlist_exists' filepath='../../module/nvpair/nvpair.c' line='2082' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_exists'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2082' column='1'/>
      <parameter type-id='type-id-6' name='name' filepath='../../module/nvpair/nvpair.c' line='2082' column='1'/>
      <return type-id='type-id-7'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_value' mangled-name='nvpair_value_boolean_value' filepath='../../module/nvpair/nvpair.c' line='2103' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_value'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2103' column='1'/>
      <parameter type-id='type-id-18' name='val' filepath='../../module/nvpair/nvpair.c' line='2103' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_byte' mangled-name='nvpair_value_byte' filepath='../../module/nvpair/nvpair.c' line='2109' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2109' column='1'/>
      <parameter type-id='type-id-20' name='val' filepath='../../module/nvpair/nvpair.c' line='2109' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_int8' mangled-name='nvpair_value_int8' filepath='../../module/nvpair/nvpair.c' line='2115' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2115' column='1'/>
      <parameter type-id='type-id-21' name='val' filepath='../../module/nvpair/nvpair.c' line='2115' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8' mangled-name='nvpair_value_uint8' filepath='../../module/nvpair/nvpair.c' line='2121' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2121' column='1'/>
      <parameter type-id='type-id-22' name='val' filepath='../../module/nvpair/nvpair.c' line='2121' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_int16' mangled-name='nvpair_value_int16' filepath='../../module/nvpair/nvpair.c' line='2127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2127' column='1'/>
      <parameter type-id='type-id-23' name='val' filepath='../../module/nvpair/nvpair.c' line='2127' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16' mangled-name='nvpair_value_uint16' filepath='../../module/nvpair/nvpair.c' line='2133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2133' column='1'/>
      <parameter type-id='type-id-24' name='val' filepath='../../module/nvpair/nvpair.c' line='2133' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_int32' mangled-name='nvpair_value_int32' filepath='../../module/nvpair/nvpair.c' line='2139' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2139' column='1'/>
      <parameter type-id='type-id-25' name='val' filepath='../../module/nvpair/nvpair.c' line='2139' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32' mangled-name='nvpair_value_uint32' filepath='../../module/nvpair/nvpair.c' line='2145' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2145' column='1'/>
      <parameter type-id='type-id-26' name='val' filepath='../../module/nvpair/nvpair.c' line='2145' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_int64' mangled-name='nvpair_value_int64' filepath='../../module/nvpair/nvpair.c' line='2151' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2151' column='1'/>
      <parameter type-id='type-id-27' name='val' filepath='../../module/nvpair/nvpair.c' line='2151' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64' mangled-name='nvpair_value_uint64' filepath='../../module/nvpair/nvpair.c' line='2157' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2157' column='1'/>
      <parameter type-id='type-id-28' name='val' filepath='../../module/nvpair/nvpair.c' line='2157' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_double' mangled-name='nvpair_value_double' filepath='../../module/nvpair/nvpair.c' line='2164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_double'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2164' column='1'/>
      <parameter type-id='type-id-37' name='val' filepath='../../module/nvpair/nvpair.c' line='2164' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_string' mangled-name='nvpair_value_string' filepath='../../module/nvpair/nvpair.c' line='2171' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2171' column='1'/>
      <parameter type-id='type-id-34' name='val' filepath='../../module/nvpair/nvpair.c' line='2171' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist' mangled-name='nvpair_value_nvlist' filepath='../../module/nvpair/nvpair.c' line='2177' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2177' column='1'/>
      <parameter type-id='type-id-30' name='val' filepath='../../module/nvpair/nvpair.c' line='2177' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_boolean_array' mangled-name='nvpair_value_boolean_array' filepath='../../module/nvpair/nvpair.c' line='2183' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_boolean_array'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2183' column='1'/>
      <parameter type-id='type-id-32' name='val' filepath='../../module/nvpair/nvpair.c' line='2183' column='1'/>
      <parameter type-id='type-id-31' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2183' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_byte_array' mangled-name='nvpair_value_byte_array' filepath='../../module/nvpair/nvpair.c' line='2189' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_byte_array'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2189' column='1'/>
      <parameter type-id='type-id-48' name='val' filepath='../../module/nvpair/nvpair.c' line='2189' column='1'/>
      <parameter type-id='type-id-31' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2189' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_int8_array' mangled-name='nvpair_value_int8_array' filepath='../../module/nvpair/nvpair.c' line='2195' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int8_array'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2195' column='1'/>
      <parameter type-id='type-id-45' name='val' filepath='../../module/nvpair/nvpair.c' line='2195' column='1'/>
      <parameter type-id='type-id-31' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2195' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_uint8_array' mangled-name='nvpair_value_uint8_array' filepath='../../module/nvpair/nvpair.c' line='2201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint8_array'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2201' column='1'/>
      <parameter type-id='type-id-52' name='val' filepath='../../module/nvpair/nvpair.c' line='2201' column='1'/>
      <parameter type-id='type-id-31' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2201' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_int16_array' mangled-name='nvpair_value_int16_array' filepath='../../module/nvpair/nvpair.c' line='2207' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int16_array'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2207' column='1'/>
      <parameter type-id='type-id-42' name='val' filepath='../../module/nvpair/nvpair.c' line='2207' column='1'/>
      <parameter type-id='type-id-31' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2207' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_uint16_array' mangled-name='nvpair_value_uint16_array' filepath='../../module/nvpair/nvpair.c' line='2213' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint16_array'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2213' column='1'/>
      <parameter type-id='type-id-49' name='val' filepath='../../module/nvpair/nvpair.c' line='2213' column='1'/>
      <parameter type-id='type-id-31' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2213' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_int32_array' mangled-name='nvpair_value_int32_array' filepath='../../module/nvpair/nvpair.c' line='2219' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int32_array'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2219' column='1'/>
      <parameter type-id='type-id-43' name='val' filepath='../../module/nvpair/nvpair.c' line='2219' column='1'/>
      <parameter type-id='type-id-31' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2219' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_uint32_array' mangled-name='nvpair_value_uint32_array' filepath='../../module/nvpair/nvpair.c' line='2225' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint32_array'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2225' column='1'/>
      <parameter type-id='type-id-50' name='val' filepath='../../module/nvpair/nvpair.c' line='2225' column='1'/>
      <parameter type-id='type-id-31' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2225' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_int64_array' mangled-name='nvpair_value_int64_array' filepath='../../module/nvpair/nvpair.c' line='2231' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_int64_array'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2231' column='1'/>
      <parameter type-id='type-id-44' name='val' filepath='../../module/nvpair/nvpair.c' line='2231' column='1'/>
      <parameter type-id='type-id-31' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2231' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_uint64_array' mangled-name='nvpair_value_uint64_array' filepath='../../module/nvpair/nvpair.c' line='2237' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_uint64_array'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2237' column='1'/>
      <parameter type-id='type-id-51' name='val' filepath='../../module/nvpair/nvpair.c' line='2237' column='1'/>
      <parameter type-id='type-id-31' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2237' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_string_array' mangled-name='nvpair_value_string_array' filepath='../../module/nvpair/nvpair.c' line='2243' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_string_array'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2243' column='1'/>
      <parameter type-id='type-id-35' name='val' filepath='../../module/nvpair/nvpair.c' line='2243' column='1'/>
      <parameter type-id='type-id-31' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2243' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_nvlist_array' mangled-name='nvpair_value_nvlist_array' filepath='../../module/nvpair/nvpair.c' line='2249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_nvlist_array'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2249' column='1'/>
      <parameter type-id='type-id-46' name='val' filepath='../../module/nvpair/nvpair.c' line='2249' column='1'/>
      <parameter type-id='type-id-31' name='nelem' filepath='../../module/nvpair/nvpair.c' line='2249' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_hrtime' mangled-name='nvpair_value_hrtime' filepath='../../module/nvpair/nvpair.c' line='2255' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_hrtime'>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2255' column='1'/>
      <parameter type-id='type-id-39' name='val' filepath='../../module/nvpair/nvpair.c' line='2255' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_add_nvpair' mangled-name='nvlist_add_nvpair' filepath='../../module/nvpair/nvpair.c' line='2264' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_add_nvpair'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2264' column='1'/>
      <parameter type-id='type-id-17' name='nvp' filepath='../../module/nvpair/nvpair.c' line='2264' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_merge' mangled-name='nvlist_merge' filepath='../../module/nvpair/nvpair.c' line='2281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_merge'>
      <parameter type-id='type-id-1' name='dst' filepath='../../module/nvpair/nvpair.c' line='2281' column='1'/>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2281' column='1'/>
      <parameter type-id='type-id-40' name='flag' filepath='../../module/nvpair/nvpair.c' line='2281' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_size' mangled-name='nvlist_size' filepath='../../module/nvpair/nvpair.c' line='2650' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_size'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2650' column='1'/>
      <parameter type-id='type-id-4' name='size' filepath='../../module/nvpair/nvpair.c' line='2650' column='1'/>
      <parameter type-id='type-id-40' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2650' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_pack' mangled-name='nvlist_pack' filepath='../../module/nvpair/nvpair.c' line='2659' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_pack'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2659' column='1'/>
      <parameter type-id='type-id-34' name='bufp' filepath='../../module/nvpair/nvpair.c' line='2659' column='1'/>
      <parameter type-id='type-id-4' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2659' column='1'/>
      <parameter type-id='type-id-40' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2659' column='1'/>
      <parameter type-id='type-id-40' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='2660' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_xpack' mangled-name='nvlist_xpack' filepath='../../module/nvpair/nvpair.c' line='2667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xpack'>
      <parameter type-id='type-id-1' name='nvl' filepath='../../module/nvpair/nvpair.c' line='2667' column='1'/>
      <parameter type-id='type-id-34' name='bufp' filepath='../../module/nvpair/nvpair.c' line='2667' column='1'/>
      <parameter type-id='type-id-4' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2667' column='1'/>
      <parameter type-id='type-id-40' name='encoding' filepath='../../module/nvpair/nvpair.c' line='2667' column='1'/>
      <parameter type-id='type-id-53' name='nva' filepath='../../module/nvpair/nvpair.c' line='2668' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_unpack' mangled-name='nvlist_unpack' filepath='../../module/nvpair/nvpair.c' line='2717' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_unpack'>
      <parameter type-id='type-id-5' name='buf' filepath='../../module/nvpair/nvpair.c' line='2717' column='1'/>
      <parameter type-id='type-id-3' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2717' column='1'/>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='2717' column='1'/>
      <parameter type-id='type-id-40' name='kmflag' filepath='../../module/nvpair/nvpair.c' line='2717' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvlist_xunpack' mangled-name='nvlist_xunpack' filepath='../../module/nvpair/nvpair.c' line='2723' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_xunpack'>
      <parameter type-id='type-id-5' name='buf' filepath='../../module/nvpair/nvpair.c' line='2723' column='1'/>
      <parameter type-id='type-id-3' name='buflen' filepath='../../module/nvpair/nvpair.c' line='2723' column='1'/>
      <parameter type-id='type-id-30' name='nvlp' filepath='../../module/nvpair/nvpair.c' line='2723' column='1'/>
      <parameter type-id='type-id-53' name='nva' filepath='../../module/nvpair/nvpair.c' line='2723' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../../module/nvpair/nvpair_alloc_fixed.c' comp-dir-path='/root/zfs-spp/lib/libnvpair' language='LANG_C99'>
    <var-decl name='nv_fixed_ops' type-id='type-id-54' mangled-name='nv_fixed_ops' visibility='default' filepath='../../include/sys/nvpair.h' line='138' column='1' elf-symbol-id='nv_fixed_ops'/>
    <var-decl name='nv_fixed_ops_def' type-id='type-id-56' mangled-name='nv_fixed_ops_def' visibility='default' filepath='../../module/nvpair/nvpair_alloc_fixed.c' line='103' column='1' elf-symbol-id='nv_fixed_ops_def'/>
  </abi-instr>
  <abi-instr address-size='64' path='libnvpair.c' comp-dir-path='/root/zfs-spp/lib/libnvpair' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-57'/>
    <array-type-def dimensions='1' type-id='type-id-57' size-in-bits='8' id='type-id-58'>
      <subrange length='1' type-id='type-id-59' id='type-id-60'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-57' size-in-bits='160' id='type-id-61'>
      <subrange length='20' type-id='type-id-59' id='type-id-62'/>
    </array-type-def>
    <type-decl name='double' size-in-bits='64' id='type-id-36'/>
    <enum-decl name='boolean_t' naming-typedef-id='type-id-7' filepath='../../lib/libspl/include/sys/stdtypes.h' line='26' column='1' id='type-id-63'>
      <underlying-type type-id='type-id-64'/>
      <enumerator name='B_FALSE' value='0'/>
      <enumerator name='B_TRUE' value='1'/>
    </enum-decl>
    <enum-decl name='data_type_t' naming-typedef-id='type-id-55' filepath='../../include/sys/nvpair.h' line='37' column='1' id='type-id-65'>
      <underlying-type type-id='type-id-64'/>
      <enumerator name='DATA_TYPE_DONTCARE' value='-1'/>
      <enumerator name='DATA_TYPE_UNKNOWN' value='0'/>
      <enumerator name='DATA_TYPE_BOOLEAN' value='1'/>
      <enumerator name='DATA_TYPE_BYTE' value='2'/>
      <enumerator name='DATA_TYPE_INT16' value='3'/>
      <enumerator name='DATA_TYPE_UINT16' value='4'/>
      <enumerator name='DATA_TYPE_INT32' value='5'/>
      <enumerator name='DATA_TYPE_UINT32' value='6'/>
      <enumerator name='DATA_TYPE_INT64' value='7'/>
      <enumerator name='DATA_TYPE_UINT64' value='8'/>
      <enumerator name='DATA_TYPE_STRING' value='9'/>
      <enumerator name='DATA_TYPE_BYTE_ARRAY' value='10'/>
      <enumerator name='DATA_TYPE_INT16_ARRAY' value='11'/>
      <enumerator name='DATA_TYPE_UINT16_ARRAY' value='12'/>
      <enumerator name='DATA_TYPE_INT32_ARRAY' value='13'/>
      <enumerator name='DATA_TYPE_UINT32_ARRAY' value='14'/>
      <enumerator name='DATA_TYPE_INT64_ARRAY' value='15'/>
      <enumerator name='DATA_TYPE_UINT64_ARRAY' value='16'/>
      <enumerator name='DATA_TYPE_STRING_ARRAY' value='17'/>
      <enumerator name='DATA_TYPE_HRTIME' value='18'/>
      <enumerator name='DATA_TYPE_NVLIST' value='19'/>
      <enumerator name='DATA_TYPE_NVLIST_ARRAY' value='20'/>
      <enumerator name='DATA_TYPE_BOOLEAN_VALUE' value='21'/>
      <enumerator name='DATA_TYPE_INT8' value='22'/>
      <enumerator name='DATA_TYPE_UINT8' value='23'/>
      <enumerator name='DATA_TYPE_BOOLEAN_ARRAY' value='24'/>
      <enumerator name='DATA_TYPE_INT8_ARRAY' value='25'/>
      <enumerator name='DATA_TYPE_UINT8_ARRAY' value='26'/>
      <enumerator name='DATA_TYPE_DOUBLE' value='27'/>
    </enum-decl>
    <enum-decl name='nvlist_indent_mode' filepath='../../include/libnvpair.h' line='86' column='1' id='type-id-66'>
      <underlying-type type-id='type-id-64'/>
      <enumerator name='NVLIST_INDENT_ABS' value='0'/>
      <enumerator name='NVLIST_INDENT_TABBED' value='1'/>
    </enum-decl>
    <enum-decl name='nvlist_prtctl_fmt' filepath='../../include/libnvpair.h' line='104' column='1' id='type-id-67'>
      <underlying-type type-id='type-id-64'/>
      <enumerator name='NVLIST_FMT_MEMBER_NAME' value='0'/>
      <enumerator name='NVLIST_FMT_MEMBER_POSTAMBLE' value='1'/>
      <enumerator name='NVLIST_FMT_BTWN_ARRAY' value='2'/>
    </enum-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-40'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-68'/>
    <type-decl name='long long int' size-in-bits='64' id='type-id-69'/>
    <type-decl name='short int' size-in-bits='16' id='type-id-70'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-71'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='49' column='1' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-73' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-74' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-75' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-76' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-71' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-58' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-77' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-78' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-79' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-80' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-74' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-81' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-3' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-40' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-61' visibility='default' filepath='/usr/include/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nvlist' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='85' column='1' id='type-id-82'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvl_version' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvl_nvflag' type-id='type-id-14' visibility='default' filepath='../../include/sys/nvpair.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvl_priv' type-id='type-id-16' visibility='default' filepath='../../include/sys/nvpair.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvl_flag' type-id='type-id-14' visibility='default' filepath='../../include/sys/nvpair.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='nvl_pad' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='90' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nvlist_printops' size-in-bits='3456' is-struct='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='61' column='1' id='type-id-83'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='print_boolean' type-id='type-id-84' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='print_boolean_value' type-id='type-id-85' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='print_byte' type-id='type-id-86' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='print_int8' type-id='type-id-87' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='print_uint8' type-id='type-id-86' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='print_int16' type-id='type-id-88' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='print_uint16' type-id='type-id-89' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='print_int32' type-id='type-id-84' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='print_uint32' type-id='type-id-90' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='print_int64' type-id='type-id-91' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='print_uint64' type-id='type-id-92' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='print_double' type-id='type-id-93' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='print_string' type-id='type-id-94' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='print_hrtime' type-id='type-id-95' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='print_nvlist' type-id='type-id-96' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='print_boolean_array' type-id='type-id-97' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='print_byte_array' type-id='type-id-98' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='print_int8_array' type-id='type-id-99' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='print_uint8_array' type-id='type-id-100' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='print_int16_array' type-id='type-id-101' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='print_uint16_array' type-id='type-id-102' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='print_int32_array' type-id='type-id-103' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='print_uint32_array' type-id='type-id-104' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='print_int64_array' type-id='type-id-105' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='print_uint64_array' type-id='type-id-106' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='print_string_array' type-id='type-id-107' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='print_nvlist_array' type-id='type-id-108' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nvlist_prtctl' size-in-bits='576' is-struct='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='91' column='1' id='type-id-109'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvprt_fp' type-id='type-id-110' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvprt_indent_mode' type-id='type-id-66' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvprt_indent' type-id='type-id-40' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nvprt_indentinc' type-id='type-id-40' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nvprt_nmfmt' type-id='type-id-6' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nvprt_eomfmt' type-id='type-id-6' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='nvprt_btwnarrfmt' type-id='type-id-6' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='nvprt_btwnarrfmt_nl' type-id='type-id-40' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='nvprt_dfltops' type-id='type-id-111' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='nvprt_custops' type-id='type-id-111' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='101' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nvpair' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='73' column='1' id='type-id-112'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nvp_size' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='nvp_name_sz' type-id='type-id-11' visibility='default' filepath='../../include/sys/nvpair.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='nvp_reserve' type-id='type-id-11' visibility='default' filepath='../../include/sys/nvpair.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nvp_value_elem' type-id='type-id-13' visibility='default' filepath='../../include/sys/nvpair.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='nvp_type' type-id='type-id-55' visibility='default' filepath='../../include/sys/nvpair.h' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='413' column='1' id='type-id-113'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-114' visibility='default' filepath='/usr/include/regex.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-115' visibility='default' filepath='/usr/include/regex.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-115' visibility='default' filepath='/usr/include/regex.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-116' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-5' visibility='default' filepath='/usr/include/regex.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-117' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-3' visibility='default' filepath='/usr/include/regex.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='can_be_null' type-id='type-id-118' visibility='default' filepath='/usr/include/regex.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='449'>
        <var-decl name='regs_allocated' type-id='type-id-118' visibility='default' filepath='/usr/include/regex.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='451'>
        <var-decl name='fastmap_accurate' type-id='type-id-118' visibility='default' filepath='/usr/include/regex.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='452'>
        <var-decl name='no_sub' type-id='type-id-118' visibility='default' filepath='/usr/include/regex.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='453'>
        <var-decl name='not_bol' type-id='type-id-118' visibility='default' filepath='/usr/include/regex.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='454'>
        <var-decl name='not_eol' type-id='type-id-118' visibility='default' filepath='/usr/include/regex.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='455'>
        <var-decl name='newline_anchor' type-id='type-id-118' visibility='default' filepath='/usr/include/regex.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='77' column='1' id='type-id-97'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-119' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='77' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='74' column='1' id='type-id-94'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-120' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='87' column='1' id='type-id-107'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-121' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='73' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-122' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='73' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='62' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-123' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='62' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='81' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-124' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='81' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='83' column='1' id='type-id-103'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-125' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='83' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='85' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-126' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='85' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='79' column='1' id='type-id-99'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-127' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='79' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='76' column='1' id='type-id-96'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-128' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='76' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='88' column='1' id='type-id-108'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-129' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='88' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='63' column='1' id='type-id-85'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-130' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='63' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='75' column='1' id='type-id-95'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-131' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='75' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='67' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-132' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='67' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='71' column='1' id='type-id-91'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-133' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='65' column='1' id='type-id-87'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-134' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='65' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='64' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-135' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='64' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='68' column='1' id='type-id-89'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-136' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='68' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='70' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-137' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='70' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='72' column='1' id='type-id-92'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-138' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='72' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='78' column='1' id='type-id-98'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-139' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='78' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='82' column='1' id='type-id-102'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-140' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='82' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='84' column='1' id='type-id-104'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-141' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='84' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__24' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='86' column='1' id='type-id-106'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-142' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='86' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='80' column='1' id='type-id-100'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='op' type-id='type-id-143' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='arg' type-id='type-id-81' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='80' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-72' filepath='/usr/include/bits/types/FILE.h' line='7' column='1' id='type-id-144'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-2' filepath='/usr/include/bits/types/struct_FILE.h' line='43' column='1' id='type-id-145'/>
    <typedef-decl name='__int16_t' type-id='type-id-70' filepath='/usr/include/bits/types.h' line='38' column='1' id='type-id-146'/>
    <typedef-decl name='__int32_t' type-id='type-id-40' filepath='/usr/include/bits/types.h' line='40' column='1' id='type-id-147'/>
    <typedef-decl name='__int64_t' type-id='type-id-68' filepath='/usr/include/bits/types.h' line='43' column='1' id='type-id-148'/>
    <typedef-decl name='__int8_t' type-id='type-id-71' filepath='/usr/include/bits/types.h' line='36' column='1' id='type-id-149'/>
    <typedef-decl name='__off64_t' type-id='type-id-68' filepath='/usr/include/bits/types.h' line='151' column='1' id='type-id-78'/>
    <typedef-decl name='__off_t' type-id='type-id-68' filepath='/usr/include/bits/types.h' line='150' column='1' id='type-id-75'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-59' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-115'/>
    <typedef-decl name='__uint16_t' type-id='type-id-76' filepath='/usr/include/bits/types.h' line='39' column='1' id='type-id-150'/>
    <typedef-decl name='__uint32_t' type-id='type-id-118' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-151'/>
    <typedef-decl name='__uint64_t' type-id='type-id-59' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-152'/>
    <typedef-decl name='__uint8_t' type-id='type-id-153' filepath='/usr/include/bits/types.h' line='37' column='1' id='type-id-154'/>
    <typedef-decl name='boolean_t' type-id='type-id-63' filepath='../../lib/libspl/include/sys/stdtypes.h' line='29' column='1' id='type-id-7'/>
    <typedef-decl name='data_type_t' type-id='type-id-65' filepath='../../include/sys/nvpair.h' line='71' column='1' id='type-id-55'/>
    <typedef-decl name='hrtime_t' type-id='type-id-69' filepath='../../lib/libspl/include/sys/time.h' line='78' column='1' id='type-id-38'/>
    <typedef-decl name='int16_t' type-id='type-id-146' filepath='/usr/include/bits/stdint-intn.h' line='25' column='1' id='type-id-11'/>
    <typedef-decl name='int32_t' type-id='type-id-147' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-13'/>
    <typedef-decl name='int64_t' type-id='type-id-148' filepath='/usr/include/bits/stdint-intn.h' line='27' column='1' id='type-id-15'/>
    <typedef-decl name='int8_t' type-id='type-id-149' filepath='/usr/include/bits/stdint-intn.h' line='24' column='1' id='type-id-9'/>
    <typedef-decl name='nvlist_prtctl_t' type-id='type-id-155' filepath='../../include/libnvpair.h' line='84' column='1' id='type-id-156'/>
    <typedef-decl name='nvlist_t' type-id='type-id-82' filepath='../../include/sys/nvpair.h' line='91' column='1' id='type-id-157'/>
    <typedef-decl name='nvpair_t' type-id='type-id-112' filepath='../../include/sys/nvpair.h' line='82' column='1' id='type-id-158'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-59' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-116'/>
    <typedef-decl name='regex_t' type-id='type-id-113' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-159'/>
    <typedef-decl name='size_t' type-id='type-id-59' filepath='/usr/lib/gcc/x86_64-redhat-linux/8/include/stddef.h' line='216' column='1' id='type-id-3'/>
    <typedef-decl name='uchar_t' type-id='type-id-153' filepath='../../lib/libspl/include/sys/stdtypes.h' line='31' column='1' id='type-id-8'/>
    <typedef-decl name='uint16_t' type-id='type-id-150' filepath='/usr/include/bits/stdint-uintn.h' line='25' column='1' id='type-id-12'/>
    <typedef-decl name='uint32_t' type-id='type-id-151' filepath='/usr/include/bits/stdint-uintn.h' line='26' column='1' id='type-id-14'/>
    <typedef-decl name='uint64_t' type-id='type-id-152' filepath='/usr/include/bits/stdint-uintn.h' line='27' column='1' id='type-id-16'/>
    <typedef-decl name='uint8_t' type-id='type-id-154' filepath='/usr/include/bits/stdint-uintn.h' line='24' column='1' id='type-id-10'/>
    <typedef-decl name='uint_t' type-id='type-id-118' filepath='../../lib/libspl/include/sys/stdtypes.h' line='33' column='1' id='type-id-19'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-64'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-153'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-118'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-59'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-76'/>
    <pointer-type-def type-id='type-id-144' size-in-bits='64' id='type-id-110'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-160' size-in-bits='64' id='type-id-79'/>
    <pointer-type-def type-id='type-id-145' size-in-bits='64' id='type-id-77'/>
    <pointer-type-def type-id='type-id-161' size-in-bits='64' id='type-id-73'/>
    <pointer-type-def type-id='type-id-162' size-in-bits='64' id='type-id-80'/>
    <pointer-type-def type-id='type-id-7' size-in-bits='64' id='type-id-18'/>
    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-5'/>
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-34'/>
    <qualified-type-def type-id='type-id-57' const='yes' id='type-id-163'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-119'/>
    <pointer-type-def type-id='type-id-165' size-in-bits='64' id='type-id-120'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-121'/>
    <pointer-type-def type-id='type-id-167' size-in-bits='64' id='type-id-122'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-123'/>
    <pointer-type-def type-id='type-id-169' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-170' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-172' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-128'/>
    <pointer-type-def type-id='type-id-174' size-in-bits='64' id='type-id-129'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-130'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-131'/>
    <pointer-type-def type-id='type-id-177' size-in-bits='64' id='type-id-132'/>
    <pointer-type-def type-id='type-id-178' size-in-bits='64' id='type-id-133'/>
    <pointer-type-def type-id='type-id-179' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-180' size-in-bits='64' id='type-id-135'/>
    <pointer-type-def type-id='type-id-181' size-in-bits='64' id='type-id-136'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-183' size-in-bits='64' id='type-id-138'/>
    <pointer-type-def type-id='type-id-184' size-in-bits='64' id='type-id-139'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-140'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-141'/>
    <pointer-type-def type-id='type-id-187' size-in-bits='64' id='type-id-142'/>
    <pointer-type-def type-id='type-id-188' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-23'/>
    <pointer-type-def type-id='type-id-13' size-in-bits='64' id='type-id-25'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-111'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-155'/>
    <pointer-type-def type-id='type-id-157' size-in-bits='64' id='type-id-1'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-30'/>
    <pointer-type-def type-id='type-id-158' size-in-bits='64' id='type-id-17'/>
    <pointer-type-def type-id='type-id-189' size-in-bits='64' id='type-id-114'/>
    <pointer-type-def type-id='type-id-159' size-in-bits='64' id='type-id-190'/>
    <pointer-type-def type-id='type-id-8' size-in-bits='64' id='type-id-20'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-24'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-26'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-28'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-22'/>
    <pointer-type-def type-id='type-id-153' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-81'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-160'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-161'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-162'/>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-189'/>
    <type-decl name='variadic parameter type' id='type-id-191'/>
    <type-decl name='void' id='type-id-2'/>
    <function-decl name='nvlist_prtctl_setdest' mangled-name='nvlist_prtctl_setdest' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='312' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setdest'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='312' column='1'/>
      <parameter type-id='type-id-110' name='fp' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='312' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_getdest' mangled-name='nvlist_prtctl_getdest' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='318' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_getdest'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='318' column='1'/>
      <return type-id='type-id-110'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setindent' mangled-name='nvlist_prtctl_setindent' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setindent'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='325' column='1'/>
      <parameter type-id='type-id-66' name='mode' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='325' column='1'/>
      <parameter type-id='type-id-40' name='start' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='326' column='1'/>
      <parameter type-id='type-id-40' name='inc' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='326' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_doindent' mangled-name='nvlist_prtctl_doindent' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='343' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_doindent'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='343' column='1'/>
      <parameter type-id='type-id-40' name='onemore' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='343' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_setfmt' mangled-name='nvlist_prtctl_setfmt' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='350' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_setfmt'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='350' column='1'/>
      <parameter type-id='type-id-67' name='which' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='350' column='1'/>
      <parameter type-id='type-id-6' name='fmt' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='351' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_dofmt' mangled-name='nvlist_prtctl_dofmt' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='383' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_dofmt'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='383' column='1'/>
      <parameter type-id='type-id-67' name='which' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='383' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean' mangled-name='nvlist_prtctlop_boolean' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='430' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <parameter type-id='type-id-123' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='430' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean_value' mangled-name='nvlist_prtctlop_boolean_value' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='431' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_value'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-130' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='431' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_byte' mangled-name='nvlist_prtctlop_byte' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <parameter type-id='type-id-135' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='432' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int8' mangled-name='nvlist_prtctlop_int8' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <parameter type-id='type-id-134' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='433' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint8' mangled-name='nvlist_prtctlop_uint8' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='434' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <parameter type-id='type-id-135' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='434' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int16' mangled-name='nvlist_prtctlop_int16' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='435' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <parameter type-id='type-id-132' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='435' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint16' mangled-name='nvlist_prtctlop_uint16' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='436' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <parameter type-id='type-id-136' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='436' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int32' mangled-name='nvlist_prtctlop_int32' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='437' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <parameter type-id='type-id-123' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='437' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint32' mangled-name='nvlist_prtctlop_uint32' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='438' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <parameter type-id='type-id-137' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='438' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int64' mangled-name='nvlist_prtctlop_int64' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='439' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-133' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='439' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint64' mangled-name='nvlist_prtctlop_uint64' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='440' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <parameter type-id='type-id-138' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='440' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_double' mangled-name='nvlist_prtctlop_double' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_double'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <parameter type-id='type-id-122' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='441' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_string' mangled-name='nvlist_prtctlop_string' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='442' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <parameter type-id='type-id-120' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='442' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_hrtime' mangled-name='nvlist_prtctlop_hrtime' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='443' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_hrtime'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <parameter type-id='type-id-131' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='443' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_nvlist' mangled-name='nvlist_prtctlop_nvlist' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <parameter type-id='type-id-128' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='444' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_boolean_array' mangled-name='nvlist_prtctlop_boolean_array' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_boolean_array'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <parameter type-id='type-id-119' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='456' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_byte_array' mangled-name='nvlist_prtctlop_byte_array' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='457' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_byte_array'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <parameter type-id='type-id-139' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='457' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int8_array' mangled-name='nvlist_prtctlop_int8_array' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='458' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int8_array'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <parameter type-id='type-id-127' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='458' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint8_array' mangled-name='nvlist_prtctlop_uint8_array' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='459' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint8_array'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <parameter type-id='type-id-143' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='459' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int16_array' mangled-name='nvlist_prtctlop_int16_array' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int16_array'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <parameter type-id='type-id-124' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='460' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint16_array' mangled-name='nvlist_prtctlop_uint16_array' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint16_array'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <parameter type-id='type-id-140' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='461' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int32_array' mangled-name='nvlist_prtctlop_int32_array' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='462' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int32_array'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <parameter type-id='type-id-125' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='462' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint32_array' mangled-name='nvlist_prtctlop_uint32_array' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='463' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint32_array'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-141' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='463' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_int64_array' mangled-name='nvlist_prtctlop_int64_array' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='464' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_int64_array'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <parameter type-id='type-id-126' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='464' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_uint64_array' mangled-name='nvlist_prtctlop_uint64_array' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='465' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_uint64_array'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <parameter type-id='type-id-142' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='465' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_string_array' mangled-name='nvlist_prtctlop_string_array' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_string_array'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <parameter type-id='type-id-121' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='466' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctlop_nvlist_array' mangled-name='nvlist_prtctlop_nvlist_array' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctlop_nvlist_array'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <parameter type-id='type-id-129' name='func' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <parameter type-id='type-id-81' name='private' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='467' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_alloc' mangled-name='nvlist_prtctl_alloc' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_alloc'>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='nvlist_prtctl_free' mangled-name='nvlist_prtctl_free' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='546' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prtctl_free'>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='546' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_print' mangled-name='nvlist_print' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='757' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print'>
      <parameter type-id='type-id-110' name='fp' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='757' column='1'/>
      <parameter type-id='type-id-1' name='nvl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='757' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvlist_prt' mangled-name='nvlist_prt' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='766' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_prt'>
      <parameter type-id='type-id-1' name='nvl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='766' column='1'/>
      <parameter type-id='type-id-156' name='pctl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='766' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dump_nvlist' mangled-name='dump_nvlist' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='794' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dump_nvlist'>
      <parameter type-id='type-id-1' name='list' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='794' column='1'/>
      <parameter type-id='type-id-40' name='indent' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='794' column='1'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='nvpair_value_match_regex' mangled-name='nvpair_value_match_regex' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='949' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match_regex'>
      <parameter type-id='type-id-17' name='nvp' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='949' column='1'/>
      <parameter type-id='type-id-40' name='ai' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='949' column='1'/>
      <parameter type-id='type-id-5' name='value' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <parameter type-id='type-id-190' name='value_regex' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <parameter type-id='type-id-34' name='ep' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='950' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='nvpair_value_match' mangled-name='nvpair_value_match' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='1274' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvpair_value_match'>
      <parameter type-id='type-id-17' name='nvp' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-40' name='ai' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-5' name='value' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <parameter type-id='type-id-34' name='ep' filepath='/root/zfs-spp/lib/libnvpair/libnvpair.c' line='1274' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-164'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-18'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-165'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-5'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-166'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-34'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-167'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-36'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-175'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-7'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-168'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-176'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-38'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-177'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-11'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-178'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-169'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-23'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-170'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-25'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-171'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-27'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-172'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-21'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-173'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-1'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-174'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-30'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-179'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-9'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-184'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-20'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-185'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-24'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-186'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-26'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-187'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-28'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-188'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-22'/>
      <parameter type-id='type-id-19'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-180'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-8'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-181'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-12'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-182'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-183'>
      <parameter type-id='type-id-155'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-1'/>
      <parameter type-id='type-id-6'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-40'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='libnvpair_json.c' comp-dir-path='/root/zfs-spp/lib/libnvpair' language='LANG_C99'>
    <function-decl name='nvlist_print_json' mangled-name='nvlist_print_json' filepath='/root/zfs-spp/lib/libnvpair/libnvpair_json.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='nvlist_print_json'>
      <parameter type-id='type-id-110' name='fp' filepath='/root/zfs-spp/lib/libnvpair/libnvpair_json.c' line='118' column='1'/>
      <parameter type-id='type-id-1' name='nvl' filepath='/root/zfs-spp/lib/libnvpair/libnvpair_json.c' line='118' column='1'/>
      <return type-id='type-id-40'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='nvpair_alloc_system.c' comp-dir-path='/root/zfs-spp/lib/libnvpair' language='LANG_C99'>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-192'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-118' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-118' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-81' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-81' visibility='default'/>
      </data-member>
    </class-decl>
    <class-decl name='nv_alloc' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='125' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nva_ops' type-id='type-id-54' visibility='default' filepath='../../include/sys/nvpair.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nva_arg' type-id='type-id-81' visibility='default' filepath='../../include/sys/nvpair.h' line='127' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='nv_alloc_ops' size-in-bits='320' is-struct='yes' visibility='default' filepath='../../include/sys/nvpair.h' line='130' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nv_ao_init' type-id='type-id-195' visibility='default' filepath='../../include/sys/nvpair.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='nv_ao_fini' type-id='type-id-196' visibility='default' filepath='../../include/sys/nvpair.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='nv_ao_alloc' type-id='type-id-197' visibility='default' filepath='../../include/sys/nvpair.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='nv_ao_free' type-id='type-id-198' visibility='default' filepath='../../include/sys/nvpair.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='nv_ao_reset' type-id='type-id-196' visibility='default' filepath='../../include/sys/nvpair.h' line='135' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='nv_alloc_ops_t' type-id='type-id-194' filepath='../../include/sys/nvpair.h' line='123' column='1' id='type-id-199'/>
    <typedef-decl name='nv_alloc_t' type-id='type-id-193' filepath='../../include/sys/nvpair.h' line='128' column='1' id='type-id-200'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-201'/>
    <qualified-type-def type-id='type-id-199' const='yes' id='type-id-56'/>
    <pointer-type-def type-id='type-id-56' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-202' size-in-bits='64' id='type-id-195'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-203' size-in-bits='64' id='type-id-196'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-198'/>
    <pointer-type-def type-id='type-id-205' size-in-bits='64' id='type-id-197'/>
    <var-decl name='nv_alloc_nosleep' type-id='type-id-53' mangled-name='nv_alloc_nosleep' visibility='default' filepath='../../include/sys/nvpair.h' line='139' column='1' elf-symbol-id='nv_alloc_nosleep'/>
    <var-decl name='nv_alloc_sleep_def' type-id='type-id-200' mangled-name='nv_alloc_sleep_def' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/nvpair_alloc_system.c' line='54' column='1' elf-symbol-id='nv_alloc_sleep_def'/>
    <var-decl name='nv_alloc_nosleep_def' type-id='type-id-200' mangled-name='nv_alloc_nosleep_def' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/nvpair_alloc_system.c' line='59' column='1' elf-symbol-id='nv_alloc_nosleep_def'/>
    <var-decl name='nv_alloc_sleep' type-id='type-id-53' mangled-name='nv_alloc_sleep' visibility='default' filepath='/root/zfs-spp/lib/libnvpair/nvpair_alloc_system.c' line='64' column='1' elf-symbol-id='nv_alloc_sleep'/>
    <function-type size-in-bits='64' id='type-id-202'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-201'/>
      <return type-id='type-id-40'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-203'>
      <parameter type-id='type-id-53'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-204'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-81'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-205'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-3'/>
      <return type-id='type-id-81'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='assert.c' comp-dir-path='/root/zfs-spp/lib/libspl' language='LANG_C99'>
    <var-decl name='aok' type-id='type-id-40' mangled-name='aok' visibility='default' filepath='../../lib/libspl/include/assert.h' line='37' column='1' elf-symbol-id='aok'/>
    <function-decl name='libspl_assertf' mangled-name='libspl_assertf' filepath='/root/zfs-spp/lib/libspl/assert.c' line='32' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='libspl_assertf'>
      <parameter type-id='type-id-6' name='file' filepath='/root/zfs-spp/lib/libspl/assert.c' line='32' column='1'/>
      <parameter type-id='type-id-6' name='func' filepath='/root/zfs-spp/lib/libspl/assert.c' line='32' column='1'/>
      <parameter type-id='type-id-40' name='line' filepath='/root/zfs-spp/lib/libspl/assert.c' line='32' column='1'/>
      <parameter type-id='type-id-6' name='format' filepath='/root/zfs-spp/lib/libspl/assert.c' line='33' column='1'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
